#ресурсы: железная руда (iron ore); медная руда (copper_ore); органика (organic)

recipes = {
    -1: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}},
    0: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}},
    1: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Титан': 1}, 'output2': {}},
    2: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Серебро': 1}, 'output2': {}},
    3: {'input1': {'Золотой слиток': 1}, 'input2': {'Серебро': 1}, 'output1': {'Сверхпроводящий сплав': 1}, 'output2': {}},
    4: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Боксит': 1}, 'output2': {}},
    5: {'input1': {'Железная руда': 2}, 'input2': {}, 'output1': {'Железный слиток': 1}, 'output2': {}},
    6: {'input1': {'Медная руда': 1}, 'input2': {}, 'output1': {'Медный слиток': 1}, 'output2': {}},
    7: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Золотая руда': 1}, 'output2': {}},
    8: {'input1': {'Древесина': 5}, 'input2': {}, 'output1': {'уголь': 1}, 'output2': {}},
    9: {'input1': {'уголь': 4}, 'input2': {}, 'output1': {'Угольный брикет': 1}, 'output2': {}},
    10: {'input1': {'Аметистовые залежи': 1}, 'input2': {}, 'output1': {'Кварцевый кристалл': 2}, 'output2': {}},
    11: {'input1': {'Песок': 3}, 'input2': {}, 'output1': {'Кремний': 2}, 'output2': {'Щебень': 2}},
    12: {'input1': {'Песок': 4}, 'input2': {}, 'output1': {'Кремний': 1}, 'output2': {}},
    13: {'input1': {'Известняк': 1}, 'input2': {'Вода': 1}, 'output1': {'Цемент': 1}, 'output2': {}},
    14: {'input1': {'Песок': 2}, 'input2': {}, 'output1': {'Щебень': 1}, 'output2': {}},
    15: {'input1': {'Цемент': 1}, 'input2': {'Щебень': 1}, 'output1': {'Бетон': 1}, 'output2': {}},
    16: {'input1': {'Кварцевый кристалл': 2}, 'input2': {}, 'output1': {'Стекло': 1}, 'output2': {}},
    17: {'input1': {'Полиметаллическая руда': 2}, 'input2': {'органика': 5}, 'output1': {'Эмаль': 1}, 'output2': {}},
    18: {'input1': {'Кварцевый кристалл': 2}, 'input2': {'Эмаль': 1}, 'output1': {'Эмалевое стекло': 1}, 'output2': {}},
    19: {'input1': {'Вода': 1}, 'input2': {'Боксит': 1}, 'output1': {'Глинозём': 1}, 'output2': {}},
    20: {'input1': {'Иридий': 7}, 'input2': {}, 'output1': {'Иридиевый слиток': 1}, 'output2': {}},
    21: {'input1': {'Нефть': 3}, 'input2': {}, 'output1': {'Пластик': 2}, 'output2': {}},
    22: {'input1': {'Нефть': 2}, 'input2': {}, 'output1': {'Резина': 3}, 'output2': {}},
    23: {'input1': {'Нефть': 1}, 'input2': {}, 'output1': {'Мазут': 1}, 'output2': {}},
    24: {'input1': {'Метан': 6}, 'input2': {}, 'output1': {'бензол': 1}, 'output2': {}},
    25: {'input1': {'Мазут': 1}, 'input2': {'Бензол': 1}, 'output1': {'Топливо': 1}, 'output2': {}},
    26: {'input1': {}, 'input2': {}, 'output1': {'Железная руда': 1}, 'output2': {}}
}


