recipes = {
    -1: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {}},
    0: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {}},
    1: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Титан': 1}, 'output2': {}, 'output3': {}},
    2: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Серебро': 1}, 'output2': {}, 'output3': {}},
    3: {'input1': {'Золотой слиток': 1}, 'input2': {'Серебро': 1}, 'output1': {'Сверхпроводящий сплав': 1}, 'output2': {}, 'output3': {}},
    4: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Боксит': 1}, 'output2': {}, 'output3': {}},
    5: {'input1': {'Железная руда': 1}, 'input2': {}, 'output1': {'Железный слиток': 1}, 'output2': {}, 'output3': {}},
    6: {'input1': {'Медная руда': 1}, 'input2': {}, 'output1': {'Медный слиток': 1}, 'output2': {}, 'output3': {}},
    7: {'input1': {'Полиметаллическая руда': 5}, 'input2': {}, 'output1': {'Золотая руда': 1}, 'output2': {}, 'output3': {}},
    8: {'input1': {'Древесина': 5}, 'input2': {}, 'output1': {'Уголь': 1}, 'output2': {}, 'output3': {}},
    9: {'input1': {'Уголь': 1}, 'input2': {}, 'output1': {'Угольный брикет': 1}, 'output2': {}, 'output3': {}},
    10: {'input1': {'Залежи аметиста': 1}, 'input2': {}, 'output1': {'Кварцевый кристалл': 2}, 'output2': {}, 'output3': {}},
    11: {'input1': {'Песок': 3}, 'input2': {}, 'output1': {'Кремний': 2}, 'output2': {}, 'output3': {}},
    12: {'input1': {'Песок': 4}, 'input2': {}, 'output1': {'Кремний': 1}, 'output2': {}, 'output3': {}},
    13: {'input1': {'Известняк': 1}, 'input2': {'Вода': 1}, 'output1': {'Цемент': 1}, 'output2': {}, 'output3': {}},
    14: {'input1': {'Песок': 2}, 'input2': {}, 'output1': {'Щебень': 1}, 'output2': {}, 'output3': {}},
    15: {'input1': {'Цемент': 1}, 'input2': {'Щебень': 1}, 'output1': {'Бетон': 1}, 'output2': {}, 'output3': {}},
    16: {'input1': {'Кварцевый кристалл': 2}, 'input2': {}, 'output1': {'Стекло': 1}, 'output2': {}, 'output3': {}},
    17: {'input1': {'Полиметаллическая руда': 2}, 'input2': {'Органика': 5}, 'output1': {'Эмаль': 1}, 'output2': {}, 'output3': {}},
    18: {'input1': {'Кварцевый кристалл': 2}, 'input2': {'Эмаль': 1}, 'output1': {'Эмалевое стекло': 1}, 'output2': {}, 'output3': {}},
    19: {'input1': {'Вода': 1}, 'input2': {'Боксит': 1}, 'output1': {'Глинозём': 1}, 'output2': {}, 'output3': {}},
    20: {'input1': {'Иридий': 7}, 'input2': {}, 'output1': {'Иридиевый слиток': 1}, 'output2': {}, 'output3': {}},
    21: {'input1': {'Нефть': 3}, 'input2': {}, 'output1': {'Пластик': 2}, 'output2': {}, 'output3': {}},
    22: {'input1': {'Нефть': 2}, 'input2': {}, 'output1': {'Резина': 3}, 'output2': {}, 'output3': {}},
    23: {'input1': {'Нефть': 1}, 'input2': {}, 'output1': {'Мазут': 1}, 'output2': {}, 'output3': {}},
    24: {'input1': {'Метан': 6}, 'input2': {}, 'output1': {'Бензол': 1}, 'output2': {}, 'output3': {}},
    25: {'input1': {'Мазут': 1}, 'input2': {'Бензол': 1}, 'output1': {'Топливо': 1}, 'output2': {}, 'output3': {}},
    26: {'input1': {'Железный слиток': 1}, 'input2': {}, 'output1': {'Магнит': 1}, 'output2': {}, 'output3': {}},
    27: {'input1': {'Органика': 3}, 'input2': {}, 'output1': {'Смазка': 1}, 'output2': {}, 'output3': {}},
    28: {'input1': {'Железный слиток': 2}, 'input2': {}, 'output1': {'Железный корпус': 1}, 'output2': {}, 'output3': {}},
    29: {'input1': {'Железный слиток': 1}, 'input2': {}, 'output1': {'Болты': 5}, 'output2': {}, 'output3': {}},
    30: {'input1': {'Медный слиток': 2}, 'input2': {}, 'output1': {'Медная проволока': 1}, 'output2': {}, 'output3': {}},
    31: {'input1': {'Золотой слиток': 2}, 'input2': {}, 'output1': {'Золотая проволока': 1}, 'output2': {}, 'output3': {}},
    32: {'input1': {'Эмалевое стекло': 1}, 'input2': {'Титановый корпус': 1}, 'output1': {'Остеклённая панель': 1}, 'output2': {}, 'output3': {}},
    33: {'input1': {'Алюминий': 2}, 'input2': {}, 'output1': {'Алюминиевый корпус': 1}, 'output2': {}, 'output3': {}},
    34: {'input1': {'Пластик': 2}, 'input2': {}, 'output1': {'Пластмассовый корпус': 2}, 'output2': {}, 'output3': {}},
    35: {'input1': {'Болты': 10}, 'input2': {'Железный слиток': 1}, 'output1': {'Шестерни': 1}, 'output2': {}, 'output3': {}},
    36: {'input1': {'Железный корпус': 1}, 'input2': {'Смазка': 1}, 'output1': {'Ротор': 1}, 'output2': {}, 'output3': {}},
    37: {'input1': {'Кварцевый кристалл': 1}, 'input2': {'Резина': 1}, 'output1': {'Оптоволоконный кабель': 1}, 'output2': {}, 'output3': {}},
    38: {'input1': {'Магнит': 1}, 'input2': {'Медная проволока': 1}, 'output1': {'ЭМ катушка': 1}, 'output2': {}, 'output3': {}},
    39: {'input1': {'Пластик': 3}, 'input2': {'Сверхпроводящий сплав': 1}, 'output1': {'Печатная плата': 1}, 'output2': {}, 'output3': {}},
    40: {'input1': {'Кремний': 2}, 'input2': {'Золотая проволока': 1}, 'output1': {'Процессор': 1}, 'output2': {}, 'output3': {}},
    41: {'input1': {'Печатная плата': 1}, 'input2': {'Процессор': 1}, 'output1': {'Микросхема': 1}, 'output2': {}, 'output3': {}},
    42: {'input1': {'Железный корпус': 2}, 'input2': {'Шестерни': 2}, 'output1': {'Универсальный механизм': 1}, 'output2': {}, 'output3': {}},
    43: {'input1': {'Ротор': 1}, 'input2': {'ЭМ катушка': 2}, 'output1': {'Индуктивный привод': 1}, 'output2': {}, 'output3': {}},
    44: {'input1': {'Титановый корпус': 1}, 'input2': {}, 'output1': {'Камера сгорания': 1}, 'output2': {}, 'output3': {}},
    45: {'input1': {'Камера сгорания': 1}, 'input2': {'Универсальный механизм': 1}, 'output1': {'Мотор': 1}, 'output2': {}, 'output3': {}},
    46: {'input1': {'Индуктивный привод': 1}, 'input2': {'Универсальный механизм': 1}, 'output1': {'Электромотор': 1}, 'output2': {}, 'output3': {}},
    47: {'input1': {'Пластмассовый корпус': 2}, 'input2': {}, 'output1': {'Пластиковый контейнер': 1}, 'output2': {}, 'output3': {}},
    48: {'input1': {'Оптоволоконный кабель': 2}, 'input2': {'Медная проволока': 2}, 'output1': {'Многожильный провод': 1}, 'output2': {}, 'output3': {}},
    49: {'input1': {'Железная пластина': 2}, 'input2': {'Болты': 4}, 'output1': {'Набор труб': 1}, 'output2': {}, 'output3': {}},
    50: {'input1': {'ЭМ катушка': 1}, 'input2': {'Железная пластина': 1}, 'output1': {'Колебательный контур': 1}, 'output2': {}, 'output3': {}},
    51: {'input1': {'Железный корпус': 2}, 'input2': {}, 'output1': {'Бочка': 1}, 'output2': {}, 'output3': {}},
    52: {'input1': {'Оптоволоконный кабель': 1}, 'input2': {'Печатная плата': 1}, 'output1': {'Дисплей': 1}, 'output2': {}, 'output3': {}},
    53: {'input1': {'Набор труб': 1}, 'input2': {'Алюминиевый корпус': 1}, 'output1': {'Радиатор': 1}, 'output2': {}, 'output3': {}},
    54: {'input1': {'Глинозём': 1}, 'input2': {}, 'output1': {'Алюминий': 1}, 'output2': {}, 'output3': {}},
    55: {'input1': {'Золотая руда': 1}, 'input2': {}, 'output1': {'Золотой слиток': 1}, 'output2': {}, 'output3': {}},
    56: {'input1': {'Литиевая руда': 1}, 'input2': {}, 'output1': {'Литиевый слиток': 1}, 'output2': {}, 'output3': {}},
    57: {'input1': {'Железный слиток': 1}, 'input2': {}, 'output1': {'Железная пластина': 1}, 'output2': {}, 'output3': {}},
    58: {'input1': {'Титан': 2}, 'input2': {}, 'output1': {'Титановый корпус': 1}, 'output2': {}, 'output3': {}},
    59: {'input1': {'Древесина': 2}, 'input2': {}, 'output1': {'Органика': 1}, 'output2': {}, 'output3': {}},
    60: {'input1': {'Пластиковый контейнер': 2}, 'input2': {'Остеклённая панель': 1}, 'output1': {'Биореактор': 1}, 'output2': {}, 'output3': {}},
    61: {'input1': {'Литиевый слиток': 1}, 'input2': {'Серная кислота': 1}, 'output1': {'Аккумулятор': 1}, 'output2': {}, 'output3': {}},
    62: {'input1': {'Титановый корпус': 1}, 'input2': {'Универсальный механизм': 1}, 'output1': {'Турбина': 1}, 'output2': {}, 'output3': {}},
    63: {'input1': {'Процессор': 1}, 'input2': {'Остеклённая панель': 1}, 'output1': {'Сенсор': 1}, 'output2': {}, 'output3': {}},
    64: {'input1': {'Алюминиевый корпус': 2}, 'input2': {'Сверхпроводящий сплав': 1}, 'output1': {'Высокотехнологичная обшивка': 1}, 'output2': {}, 'output3': {}},
    65: {'input1': {'Радиатор': 1}, 'input2': {'Сенсор': 1}, 'output1': {'Модуль контроля температуры': 1}, 'output2': {}, 'output3': {}},
    66: {'input1': {'Микросхема': 1}, 'input2': {'Процессор': 1}, 'output1': {'Компьютерный чип': 1}, 'output2': {}, 'output3': {}},
    67: {'input1': {'Мотор': 1}, 'input2': {'Камера сгорания': 1}, 'output1': {'Двигатель': 1}, 'output2': {}, 'output3': {}},
    68: {'input1': {'Колебательный контур': 1}, 'input2': {'Золотая проволока': 1}, 'output1': {'Радиопередатчик': 1}, 'output2': {}, 'output3': {}},
    69: {'input1': {'Иридиевый слиток': 1}, 'input2': {'Микросхема': 1}, 'output1': {'Квантовый чип': 1}, 'output2': {}, 'output3': {}},
    70: {'input1': {'Квантовый чип': 1}, 'input2': {'Компьютерный чип': 1}, 'output1': {'Ядро ИИ': 1}, 'output2': {}, 'output3': {}},
    71: {'input1': {'Двигатель': 1}, 'input2': {'Турбина': 1}, 'output1': {'Реактивный двигатель': 1}, 'output2': {}, 'output3': {}},
    72: {'input1': {'Индуктивный привод': 1}, 'input2': {'Сверхпроводящий сплав': 1}, 'output1': {'Турбогенератор магнитного поля': 1}, 'output2': {}, 'output3': {}},
    73: {'input1': {'Урановая руда': 5}, 'input2': {'Железный корпус': 1}, 'output1': {'Ядерная ячейка': 1}, 'output2': {}, 'output3': {}},
    74: {'input1': {'Ядро ИИ': 1}, 'input2': {'Радиопередатчик': 1}, 'output1': {'Контроллер ИИ роя': 1}, 'output2': {}, 'output3': {}},
    75: {'input1': {'Реактивный двигатель': 1}, 'input2': {'Турбогенератор магнитного поля': 1}, 'output1': {'Ионные ускорители': 1}, 'output2': {}, 'output3': {}},
    76: {'input1': {'Турбогенератор магнитного поля': 1}, 'input2': {'Квантовый чип': 1}, 'output1': {'ЭМ стабилизатор плазмы': 1}, 'output2': {}, 'output3': {}},
    77: {'input1': {}, 'input2': {}, 'output1': {'Железная руда': 1}, 'output2': {}, 'output3': {}},
    78: {'input1': {}, 'input2': {}, 'output1': {'Медная руда': 1}, 'output2': {}, 'output3': {}},
    79: {'input1': {}, 'input2': {}, 'output1': {'Полиметаллическая руда': 1}, 'output2': {}, 'output3': {}},
    80: {'input1': {}, 'input2': {}, 'output1': {'Золотая руда': 1}, 'output2': {}, 'output3': {}},
    81: {'input1': {}, 'input2': {}, 'output1': {'Уголь': 1}, 'output2': {}, 'output3': {}},
    82: {'input1': {}, 'input2': {}, 'output1': {'Древесина': 1}, 'output2': {}, 'output3': {}},
    83: {'input1': {}, 'input2': {}, 'output1': {'Вода': 5}, 'output2': {}, 'output3': {}},
    84: {'input1': {}, 'input2': {}, 'output1': {'Нефть': 1}, 'output2': {}, 'output3': {}},
    85: {'input1': {}, 'input2': {}, 'output1': {'Метан': 1}, 'output2': {}, 'output3': {}},
    86: {'input1': {}, 'input2': {}, 'output1': {'Урановая руда': 1}, 'output2': {}, 'output3': {}},
    87: {'input1': {}, 'input2': {}, 'output1': {'Тритий': 1}, 'output2': {}, 'output3': {}},
    88: {'input1': {}, 'input2': {}, 'output1': {'Литиевая руда': 1}, 'output2': {}, 'output3': {}},
    89: {'input1': {}, 'input2': {}, 'output1': {'Серная кислота': 1}, 'output2': {}, 'output3': {}},
    90: {'input1': {}, 'input2': {}, 'output1': {'Залежи аметиста': 1}, 'output2': {}, 'output3': {}},
    91: {'input1': {}, 'input2': {}, 'output1': {'Песок': 1}, 'output2': {}, 'output3': {}},
    92: {'input1': {}, 'input2': {}, 'output1': {'Известняк': 1}, 'output2': {}, 'output3': {}},
    93: {'input1': {}, 'input2': {}, 'output1': {'Иридий': 1}, 'output2': {}, 'output3': {}},

    94: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 1}},
    95: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 2}},
    96: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 3}},
    97: {'input1': {'Уголь': 1}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 5}},
    98: {'input1': {'Угольный брикет': 1}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 10}},
    99: {'input1': {'Топливо': 1}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 10}},
    100: {'input1': {'Ядерная ячейка': 1}, 'input2': {'Вода': 5}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 20}},
    101: {'input1': {'Тритий': 1}, 'input2': {'Вода': 10}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 50}},
    102: {'input1': {}, 'input2': {}, 'output1': {}, 'output2': {}, 'output3': {'Энергия': 2}},
}


recipes_level = {
    1: [5, 6, 8, 9, 10, 11, 14, 16, 26, 27, 28, 29, 30, 35, 36, 38, 42, 43, 46, 49, 50, 51, 57, 59, 77, 78, 81, 82, 90, 91, 92, 94, 95, 96],
    2: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 71, 72, 73, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100],
    3: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86, 87, 88, 89, 90, 91, 92, 93, 94, 95, 96, 97, 98, 99, 100, 101, 102]
}
rocket_level = {
    1: [1, 2, 3, 4, 5],
    2: [1, 2, 3, 4, 5, 6, 7, 8, 9]
}
rockets = {
    1: {
        'name': 'Крылатая ракета',
        'price': {
            'Железный корпус': 2,
            'Двигатель': 1,
            'Топливо': 5,
            'Сенсор': 1,
            'Процессор': 1,
            'Болты': 10
        }
    },
    2: {
        'name': 'Грузовая ракета',
        'price': {
            'Железный корпус': 5,
            'Двигатель': 2,
            'Топливо': 15,
            'Универсальный механизм': 2,
            'Набор труб': 3,
            'Пластмассовый корпус': 2
        }
    },
    3: {
        'name': 'Ядерная ракета',
        'price': {
            'Железный корпус': 3,
            'Двигатель': 1,
            'Топливо': 8,
            'Ядерная ячейка': 3,
            'Сенсор': 1,
            'Высокотехнологичная обшивка': 1,
            'Процессор': 1
        }
    },
    4: {
        'name': 'Крылатая ракета дальнего действия',
        'price': {
            'Железный корпус': 2,
            'Реактивный двигатель': 1,
            'Топливо': 15,
            'Сенсор': 1,
            'Процессор': 1,
            'Радиопередатчик': 1,
            'Оптоволоконный кабель': 2
        }
    },
    5: {
        'name': 'Грузовая ракета дальнего действия',
        'price': {
            'Железный корпус': 5,
            'Реактивный двигатель': 1,
            'Двигатель': 1,
            'Топливо': 25,
            'Универсальный механизм': 2,
            'Набор труб': 3,
            'Пластмассовый корпус': 2,
            'Алюминиевый корпус': 2,
            'Турбина': 1
        }
    },
    6: {
        'name': 'Ядерная ракета дальнего действия',
        'price': {
            'Железный корпус': 3,
            'Реактивный двигатель': 1,
            'Топливо': 15,
            'Ядерная ячейка': 5,
            'Сенсор': 1,
            'Высокотехнологичная обшивка': 1,
            'Процессор': 1,
            'Радиопередатчик': 1,
            'Компьютерный чип': 1
        }
    },
    7: {
        'name': 'Крылатая ракета сверхдальнего действия',
        'price': {
            'Железный корпус': 2,
            'Ионные ускорители': 1,
            'Топливо': 25,
            'Сенсор': 1,
            'Квантовый чип': 1,
            'Компьютерный чип': 1,
            'Высокотехнологичная обшивка': 1
        }
    },
    8: {
        'name': 'Грузовая ракета сверхдальнего действия',
        'price': {
            'Железный корпус': 5,
            'Ионные ускорители': 1,
            'Турбогенератор магнитного поля': 1,
            'Топливо': 40,
            'Универсальный механизм': 2,
            'Набор труб': 3,
            'Пластмассовый корпус': 2,
            'Высокотехнологичная обшивка': 2,
            'Алюминиевый корпус': 2
        }
    },
    9: {
        'name': 'Ядерная ракета сверхдальнего действия',
        'price': {
            'Железный корпус': 3,
            'Ионные ускорители': 1,
            'Топливо': 30,
            'Ядерная ячейка': 10,
            'Сенсор': 1,
            'Высокотехнологичная обшивка': 3,
            'Квантовый чип': 1,
            'Контроллер ИИ роя': 1,
            'ЭМ стабилизатор плазмы': 1
        }
    }
}

transport = {
    1: {
        "title": "Походные костюмы",
        "description": "Лёгкая и прочная одежда для долгих переходов.",
        "price": {"Органика": 10, "Резина": 5}
    },
    2: {
        "title": "Экзоскелеты",
        "description": "Усиливают силу и выносливость носителя.",
        "price": {"Железный корпус": 2, "Мотор": 1, "Болты": 10, "Смазка": 2}
    },
    3: {
        "title": "Моноколёса",
        "description": "Электрическое персональное средство передвижения.",
        "price": {"Мотор": 1, "Шестерни": 4, "Железная пластина": 4, "Аккумулятор": 1}
    },
    4: {
        "title": "Ходули",
        "description": "Механические удлинители ног для быстрого шага.",
        "price": {"Железная пластина": 4, "Шестерни": 2, "Болты": 8, "Набор труб": 2}
    },
    5: {
        "title": "Скутеры",
        "description": "Компактный транспорт с бензиновым двигателем.",
        "price": {"Двигатель": 1, "Железный корпус": 1, "Топливо": 5, "Резина": 3}
    },
    6: {
        "title": "Ховербайки",
        "description": "Летающий мотоцикл на антигравитационной подушке.",
        "price": {"Двигатель": 1, "Турбина": 1, "Топливо": 10, "Сенсор": 1, "Алюминиевый корпус": 1}
    },
    7: {
        "title": "Багги",
        "description": "Лёгкий внедорожник для пересечённой местности.",
        "price": {"Двигатель": 1, "Железный корпус": 2, "Шестерни": 4, "Резина": 4, "Болты": 15}
    },
    8: {
        "title": "Внедорожники",
        "description": "Полноразмерный автомобиль повышенной проходимости.",
        "price": {"Двигатель": 1, "Железный корпус": 3, "Универсальный механизм": 2, "Топливо": 15, "Пластик": 5}
    },
    9: {
        "title": "БТР",
        "description": "Бронированная транспортёрная машина.",
        "price": {"Железный корпус": 5, "Двигатель": 2, "Титановый корпус": 1, "Универсальный механизм": 2, "Болты": 20, "Пластмассовый корпус": 3}
    },
    10: {
        "title": "Драндулет",
        "description": "Старый, но надёжный автомобиль на дизельном ходу.",
        "price": {"Железный корпус": 3, "Двигатель": 1, "Топливо": 20, "Бочка": 2, "Шестерни": 6, "Резина": 4}
    },
    11: {
        "title": "Ховер-танк",
        "description": "Тяжёлая боевая машина на магнитной подвеске.",
        "price": {"Турбогенератор магнитного поля": 1, "Высокотехнологичная обшивка": 3, "Двигатель": 2, "Ядерная ячейка": 1, "Сенсор": 2, "Пластмассовый корпус": 4}
    },
    12: {
        "title": "Катер",
        "description": "Скоростное водное судно.",
        "price": {"Алюминиевый корпус": 2, "Мотор": 2, "Топливо": 10, "Пластиковый контейнер": 1, "Набор труб": 2}
    },
    13: {
        "title": "«Паук»",
        "description": "Шагающий вездеход с гидравлическими конечностями.",
        "price": {"Роболапы паука": 1, "Мотор": 3, "Компьютерный чип": 1, "Сенсор": 2, "Железный корпус": 3}
    },
    14: {
        "title": "Джетпаки",
        "description": "Реактивный ранец для индивидуальных полётов.",
        "price": {"Реактивный двигатель": 1, "Топливо": 15, "Титановый корпус": 1, "Сенсор": 1, "Аккумулятор": 2}
    },
    15: {
        "title": "Монокоптеры",
        "description": "Одноместный складной вертолёт.",
        "price": {"Мотор": 2, "Турбина": 1, "Алюминиевый корпус": 2, "Сенсор": 1, "Процессор": 1, "Оптоволоконный кабель": 2}
    },
    16: {
        "title": "Cybertrucktor",
        "description": "Футуристичный электрический тягач с автопилотом.",
        "price": {"Высокотехнологичная обшивка": 2, "Электромотор": 2, "Аккумулятор": 4, "Компьютерный чип": 1, "Алюминиевый корпус": 3, "Дисплей": 1}
    },
    17: {
        "title": "Челнок",
        "description": "Орбитальный корабль для ближнего космоса.",
        "price": {"Ионные ускорители": 1, "Высокотехнологичная обшивка": 5, "Квантовый чип": 1, "Ядро ИИ": 1, "Топливо": 30, "Титановый корпус": 3}
    },
    18: {
        "title": "Экстроход",
        "description": "Ультимативный вездеход для экстремальных планетарных условий.",
        "price": {"Контроллер ИИ роя": 1, "ЭМ стабилизатор плазмы": 1, "Ионные ускорители": 2, "Высокотехнологичная обшивка": 8, "Квантовый чип": 2, "Ядерная ячейка": 4, "Тритий": 5}
    }
}
transport_levels={
    2: [1, 2, 3, 4, 5, 7, 8, 9],
    3: [1, 2, 3, 4, 5, 7, 8, 9, 12, 13, 14, 15, 17, 18],
    'advanced': [6, 10, 11, 16]
}
